In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
df=pd.DataFrame(columns=['Name','day_dob','month_dob','year_dob','num_siblings'])
df

Empty DataFrame
Columns: [Name, day_dob, month_dob, year_dob, num_siblings]
Index: []

In [6]:
df_2=pd.DataFrame({
    'Name':['Nahim','Jorge','Jose','Miguel'],
    'num_siblings':[2,2,2,1],
    
})
df_2

     Name  num_siblings
0   Nahim             2
1   Jorge             2
2    Jose             2
3  Miguel             1

In [7]:
df.loc[0]=['Nahim',24,11,2004,2]#df.loc[pos_de_la_Fila] Para agregar datos en fila
df.loc[1]=['Jorge',15,3,2004,2]
df.loc[2]=['Jose',31,7,2004,2]
df.loc[3]=['Miguel',25,8,2004,1]
df.loc[4]=['Luis',18,7,2004,1]
df.loc[5]=['Jonathan',6,3,2004,1]
df.loc[6]=['Angelo',26,7,2004,1]
df.loc[7]=['David',6,6,2004,2]
df.loc[8]=['Darwin',19,9,2004,1]
df.loc[9]=['Andrea',25,6,1990,1]
df

       Name  day_dob  month_dob  year_dob  num_siblings
0     Nahim       24         11      2004             2
1     Jorge       15          3      2004             2
2      Jose       31          7      2004             2
3    Miguel       25          8      2004             1
4      Luis       18          7      2004             1
5  Jonathan        6          3      2004             1
6    Angelo       26          7      2004             1
7     David        6          6      2004             2
8    Darwin       19          9      2004             1
9    Andrea       25          6      1990             1

In [8]:
df.describe() #Datos Estadisticos

         day_dob  month_dob     year_dob  num_siblings
count  10.000000  10.000000    10.000000     10.000000
mean   19.500000   6.700000  2002.600000      1.400000
std     8.449195   2.451757     4.427189      0.516398
min     6.000000   3.000000  1990.000000      1.000000
25%    15.750000   6.000000  2004.000000      1.000000
50%    21.500000   7.000000  2004.000000      1.000000
75%    25.000000   7.750000  2004.000000      2.000000
max    31.000000  11.000000  2004.000000      2.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          10 non-null     object
 1   day_dob       10 non-null     int64
 2   month_dob     10 non-null     int64
 3   year_dob      10 non-null     int64
 4   num_siblings  10 non-null     int64
dtypes: int64(4), object(1)
memory usage: 480.0+ bytes

In [10]:
df.num_siblings.mean()

1.4

In [11]:
df.day_dob.mean()

19.5

In [12]:
df.month_dob.mean()

6.7

In [13]:
df.year_dob.mean()

2002.6

In [14]:
df.shape

(10, 5)

In [15]:
media_month_ob=df.month_dob.sum()/df.shape[0]
media_month_ob

6.7

In [16]:
lista=[1,2,3,4,5,6]
media=sum(lista)/len(lista)
media

3.5

In [17]:
df.num_siblings.median()

1.0

In [18]:
df3=pd.DataFrame(lista,columns=['nums'])

In [19]:
df3.median()

nums    3.5
dtype: float64

In [20]:
df.mean()

C:\Users\Jonanyu 11.1\AppData\Local\Temp\ipykernel_4100\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

day_dob           19.5
month_dob          6.7
year_dob        2002.6
num_siblings       1.4
dtype: float64

In [21]:
df.median()

C:\Users\Jonanyu 11.1\AppData\Local\Temp\ipykernel_4100\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

day_dob           21.5
month_dob          7.0
year_dob        2004.0
num_siblings       1.0
dtype: float64

In [22]:
df.mode()

       Name  day_dob  month_dob  year_dob  num_siblings
0    Andrea      6.0        7.0    2004.0           1.0
1    Angelo     25.0        NaN       NaN           NaN
2    Darwin      NaN        NaN       NaN           NaN
3     David      NaN        NaN       NaN           NaN
4  Jonathan      NaN        NaN       NaN           NaN
5     Jorge      NaN        NaN       NaN           NaN
6      Jose      NaN        NaN       NaN           NaN
7      Luis      NaN        NaN       NaN           NaN
8    Miguel      NaN        NaN       NaN           NaN
9     Nahim      NaN        NaN       NaN           NaN

In [23]:
df['day_dob']

0    24
1    15
2    31
3    25
4    18
5     6
6    26
7     6
8    19
9    25
Name: day_dob, dtype: int64

In [24]:
df3.mode()#Ordena la data

   nums
0     1
1     2
2     3
3     4
4     5
5     6

In [25]:
df.loc[10]=['Andrea',25,6,1990,1]
df.loc[12]=['Andrea',25,6,1990,2]
df.mode()

     Name  day_dob  month_dob  year_dob  num_siblings
0  Andrea       25          6      2004             1

In [26]:
lista_2=[1,2,3,4,5,6]
df4=pd.DataFrame(lista_2).T#Me dice la transpuesta 
df4

   0  1  2  3  4  5
0  1  2  3  4  5  6

In [27]:
lista_3=[
    [1,2],
    [2,3],
    [4,5],
    [4,5],
    [3,4],
    [1,2]
]
df5=pd.DataFrame(lista_3,columns=['numeros','numeros2'])
df5

   numeros  numeros2
0        1         2
1        2         3
2        4         5
3        4         5
4        3         4
5        1         2

In [28]:
df6=pd.DataFrame(lista_3,columns=['numeros','numeros2']).T
df6

          0  1  2  3  4  5
numeros   1  2  4  4  3  1
numeros2  2  3  5  5  4  2